Revit 2027 API
StairsLanding.GetFootprintBoundary Method
 Returns the landing's boundary curves which are projected on the stairs base level.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoop GetFootprintBoundary()
Public Function GetFootprintBoundary As CurveLoop
public:
CurveLoop^ GetFootprintBoundary()
member GetFootprintBoundary : unit -> CurveLoop
Return Value
CurveLoop
 The boundary curves of the landing.
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace